app/views/orders/index.html.haml

.page-header
  %h1= t('headers.orders.index')
---
SELECT "orders".* FROM "orders"