app/controllers/cars_controller.rb

  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save
---
INSERT INTO "cars" ("mark", "class_c", "license_plate", "color", "year_of_issue", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["mark", "1123"], ["class_c", "Бизнес"], ["license_plate", "321"], ["color", "3"], ["year_of_issue", 123], ["created_at", 2017-04-27 19:25:48 UTC], ["updated_at", 2017-04-27 19:25:48 UTC]]

  def update
    respond_to do |format|
      if @car.update(car_params)
---
UPDATE "cars" SET "class_c" = $1, "updated_at" = $2 WHERE "cars"."id" = $3  [["class_c", "Эконом"], ["updated_at", 2017-04-27 19:10:03 UTC], ["id", 1]]