app/controllers/driver1s_controller.rb

  def index
    @driver1s = Driver1.all
---
SELECT "driver1s".* FROM "driver1s"

  def create
    @driver1 = Driver1.new(driver1_params)

    respond_to do |format|
      if @driver1.save
---
INSERT INTO "driver1s" ("fn", "sn", "ln", "birthday", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["fn", ""], ["sn", ""], ["ln", ""], ["birthday", Wed, 26 Apr 2017], ["created_at", 2017-04-26 19:52:10 UTC], ["updated_at", 2017-04-26 19:52:10 UTC]]

  def update
    respond_to do |format|
      if @driver1.update(driver1_params)
---
UPDATE "driver1s" SET "fn" = $1, "sn" = $2, "ln" = $3, "inn" = $4, "series_p" = $5, "number_p" = $6, "updated_at" = $7 WHERE "driver1s"."id" = $8  [["fn", "1"], ["sn", "1"], ["ln", "1"], ["inn", 123], ["series_p", 123], ["number_p", 123], ["updated_at", 2017-04-27 14:46:31 UTC], ["id", 2]]

  def destroy
    @driver1.destroy
---
DELETE FROM "driver1s" WHERE "driver1s"."id" = $1  [["id", 1]]

    def set_driver1
      @driver1 = Driver1.find(params[:id])
---
SELECT  "driver1s".* FROM "driver1s" WHERE "driver1s"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]