app/controllers/orders_controller.rb

INSERT INTO "orders" ("date_o", "time_o", "address_o", "address_p", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date_o", Thu, 27 Apr 2017], ["time_o", 2017-04-27 15:33:00 UTC], ["address_o", ""], ["address_p", ""], ["created_at", 2017-04-27 12:33:08 UTC], ["updated_at", 2017-04-27 12:33:08 UTC]]
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save

UPDATE "orders" SET "driver1_id" = $1, "rate_id" = $2, "updated_at" = $3 WHERE "orders"."id" = $4  [["driver1_id", 1], ["rate_id", 1], ["updated_at", 2017-04-27 19:37:46 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @order.update(order_params)