app/controllers/rates_controller.rb

  def index
    @rates = Rate.all
---
SELECT "rates".* FROM "rates"

  def create
    @rate = Rate.new(rate_params)

    respond_to do |format|
      if @rate.save
---
INSERT INTO "rates" ("name_r", "times_of_day", "range", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name_r", ""], ["times_of_day", ""], ["range", ""], ["price", "123"], ["created_at", 2017-04-27 15:05:45 UTC], ["updated_at", 2017-04-27 15:05:45 UTC]]

  def destroy
    @rate.destroy
---
DELETE FROM "rates" WHERE "rates"."id" = $1  [["id", 1]]

    def set_rate
      @rate = Rate.find(params[:id])
---
SELECT  "rates".* FROM "rates" WHERE "rates"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]